#1번 문제
x= c(1,21,6,5,3,10)


#2번 문제
x <- c (3, 5, 6, 8)
y <- c (3, 3, 3)
x+y
#⑤	6, 8, 9, 11


#3번 문제
z <- 0:9
digits <- as.character(z)
as.integer(digits)
#②	0, 1, 2, 3, 4, 5, 6, 7, 8, 9


#4번 문제
x <- c(1,2,3,4)
(x+2)[(!is.na(x)) & x > 0] -> k
k
#④	3, 4, 5, 6


#5번 문제
x <- c(2, 4, 6, 8)
y <- c(TRUE, TRUE, FALSE, TRUE)
sum(x[y])
#③	14


#6번 문제
x <- c(34, 56, 55, 87, NA, 4, 77, NA, 21, NA, 39)
#③	sum(is.na(x))


#7번 문제
x=c(4,6,5,7,10,9,4,15)
y=c(0,10,1,8,2,3,4,1)
x*y
# 0 60  5 56 20 27 16 15


#8번 문제
a=c(1,2,4,5,6)
b=c(3,2,4,1,9)
cbind(a,b)
#     a b
#[1,] 1 3
#[2,] 2 2
#[3,] 4 4
#[4,] 5 1
#[5,] 6 9


#9번 문제
a=c(10,2,4,15)
b=c(3,12,4,11)
rbind(a,b)
#  [,1] [,2] [,3] [,4]
#a   10    2    4   15
#b    3   12    4   11


#10번 문제
x=c(1:12)
dim(x) #NULL
length(x) #12
#dim <- 행과 열의 길이 모두 측정
#length <- 요소의 개수 측정


#11번 문제
x=c('blue',10,'green',20)
is.character(x)
#TRUE


#12번 문제
year=c(2005:2016)
month=c(1:12)
day=c(1:31)
#list(year=c(2005:2016),month=c(1:12),day=c(1:31))


#13번 문제
x=c(1,3,4,7,11,18,29)
#계산결과: x*2 ,  x/2,  sqrt(x)

#list("x*2"=x*2,"x/2"=x/2,"sqrt(x)"=sqrt(x))


#14번 문제
N=matrix(c(1:9),nrow=3,ncol=3,dimnames=list(c('a','b','c'),c('A','B','C')))
diag(N) #1 5 9

N[1][1] #1
N[1,1] #1
N['a','A'] #1
N['a','B'] #4


#15번 문제
M=matrix(c(1:9),3,3,byrow=T)
N=matrix(c(1:9),3,3)

M%*%N
#     [,1] [,2] [,3]
#[1,]   14   32   50
#[2,]   32   77  122
#[3,]   50  122  194